W6D3/first_controller_project/first_controller/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email") VALUES ($1, $2) RETURNING "id"  [["username", "thnx"], ["email", "bai"]]
---
    def create
       user = User.new(params.require(:user).permit(:username,:email))
       if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "email" = $2 WHERE "users"."id" = $3  [["username", "Lex Luthor"], ["email", "supermansux@lexcorp.com"], ["id", 1]]
---
   def update
         user =  User.find_by(id: params[:id])

        if user.update(params.require(:user).permit(:username,:email))